// 1 ==============================

// Выполнить неглубокое копирование массива с помощью:
// - метода slice()
// - метода Array.from()
// - Spread-оператора
// - метода Object.assign()

// 2 ==============================

// Выполнить неглубокое копирование объекта с помощью:
// - Spread-оператора
// - цикла for-in
// - метода Object.assign()

// 3 ==============================

// Реализовать несколько вариантов глубокого копирования многомерных массивов, которые не содержат объектов.
// В реализации задачи помогут - метод slice(), Spread-оператор, цикл for или map.

// 4 ==============================

// Выполнить глубокое копирование массивов и объектов с помощью json-методов.